posts/replace-new-hard-disk/index.html
<!DOCTYPE html>
<html lang="zh_tw">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width">
<title>為 windows 10，換一顆硬碟 | Simple Life</title>
<link href="../../assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
<link rel="alternate" type="application/rss+xml" title="RSS" href="../../rss.xml">
<link rel="canonical" href="https://mariolong.github.io/posts/replace-new-hard-disk/">
<!--[if lt IE 9]><![endif]--><meta name="author" content="Mario Long">
<link rel="prev" href="../happy-current/" title="快樂，當下" type="text/html">
<link rel="next" href="../hide-driver-on-windows/" title="Windows 10 中，隱藏磁碟機" type="text/html">
<meta property="og:site_name" content="Simple Life">
<meta property="og:title" content="為 windows 10，換一顆硬碟">
<meta property="og:url" content="https://mariolong.github.io/posts/replace-new-hard-disk/">
<meta property="og:description" content="昨晚，開啓 windows 10 時，速度變得很慢，等了好久，好不容易才進入
windows 畫面。也不用檢查，就是讀 D 槽時變得很慢。前幾天才想換一個大一點的硬碟，它，立刻就出問題，讓我不得不換，真玄了。



SMART check


用 linux 讀這硬碟，還是很正常。用 smartctl 檢查，是有 error log，為了資料的安全起見，還是換吧。



這硬碟的一般資訊如下：

">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2018-05-24T13:43:24+08:00">
<meta property="article:tag" content="smart">
<meta property="article:tag" content="WD">
<meta property="article:tag" content="windows">
</head>
<body>

	<a href="#content" class="sr-only sr-only-focusable">略過主內容</a>

	<!-- Menubar -->

	<div class="navbar navbar-static-top" id="navbar">
		<div class="navbar-inner">
			<div class="container">

				<!-- .btn-navbar is used as the toggle for collapsed navbar content -->
				<a class="btn btn-navbar" data-toggle="collapse" data-target=".nav-collapse">
					<span class="icon-bar"></span>
					<span class="icon-bar"></span>
					<span class="icon-bar"></span>
				</a>

				<a class="brand" href="https://mariolong.github.io/">

						<span id="blog-title">Simple Life</span>
				</a>

				<!-- Everything you want hidden at 940px or less, place within here -->
				<div class="nav-collapse collapse">
					<ul class="nav pull-right">
<li>
<a href="../../categories/cat_computer/">電腦</a>
                </li>
<li>
<a href="../../categories/cat_investment/">投資</a>
                </li>
<li>
<a href="../../categories/cat_life/">生活</a>
                </li>
<li>
<a href="../../archive.html">歸檔</a>
                </li>
<li>
<a href="../../rss.xml">訂閱</a>

						
					</li>
</ul>
<ul class="nav pull-right"></ul>
</div>
			</div>
		</div>
	</div>
	<!-- End of Menubar -->
	<div class="yue">
		<div class="container-fluid" id="content" role="main">
		<!--Body content-->
			<div class="row-fluid">
				<div class="span2"></div>
				<div class="span8">
					
					
<article class="post-text h-entry hentry postpage" itemscope="itemscope" itemtype="http://schema.org/Article"><header><h1 class="p-name entry-title" itemprop="headline name"><a href="." class="u-url">為 windows 10，換一顆硬碟</a></h1>

        <div class="metadata">
            <p class="byline author vcard"><span class="byline-name fn" itemprop="author">
                    Mario Long
            </span></p>
            <p class="dateline">
            <a href="." rel="bookmark">
            <time class="published dt-published" datetime="2018-05-24T13:43:24+08:00" itemprop="datePublished" title="2018-05-24 13:43">2018-05-24 13:43</time></a>
            </p>
                <p class="commentline">
        
    <a href="#disqus_thread" data-disqus-identifier="cache/posts/replace-new-hard-disk.html">Comments</a>


            

        </p>
</div>
        

    </header><div class="e-content entry-content" itemprop="articleBody text">
    <p>
昨晚，開啓 windows 10 時，速度變得很慢，等了好久，好不容易才進入
windows 畫面。也不用檢查，就是讀 D 槽時變得很慢。前幾天才想換一個大一點的硬碟，它，立刻就出問題，讓我不得不換，真玄了。
</p>

<div id="outline-container-orgdbc6566" class="outline-2">
<h2 id="orgdbc6566">SMART check</h2>
<div class="outline-text-2" id="text-orgdbc6566">
<p>
用 linux 讀這硬碟，還是很正常。用 smartctl 檢查，是有 error log，為了資料的安全起見，還是換吧。
</p>

<p>
這硬碟的一般資訊如下：
</p>

<pre class="example">
SMART Attributes Data Structure revision number: 16
Vendor Specific SMART Attributes with Thresholds:
ID# ATTRIBUTE_NAME          FLAG     VALUE WORST THRESH TYPE      UPDATED  WHEN_FAILED RAW_VALUE
  1 Raw_Read_Error_Rate     0x000b   100   100   016    Pre-fail  Always       -       0
  2 Throughput_Performance  0x0005   140   140   054    Pre-fail  Offline      -       69
  3 Spin_Up_Time            0x0007   129   129   024    Pre-fail  Always       -       294 (Average 294)
  4 Start_Stop_Count        0x0012   100   100   000    Old_age   Always       -       2302
  5 Reallocated_Sector_Ct   0x0033   100   100   005    Pre-fail  Always       -       0
  7 Seek_Error_Rate         0x000b   100   100   067    Pre-fail  Always       -       0
  8 Seek_Time_Performance   0x0005   124   124   020    Pre-fail  Offline      -       33
  9 Power_On_Hours          0x0012   099   099   000    Old_age   Always       -       12850
 10 Spin_Retry_Count        0x0013   100   100   060    Pre-fail  Always       -       0
 12 Power_Cycle_Count       0x0032   100   100   000    Old_age   Always       -       1815
192 Power-Off_Retract_Count 0x0032   099   099   000    Old_age   Always       -       2392
193 Load_Cycle_Count        0x0012   099   099   000    Old_age   Always       -       2392
194 Temperature_Celsius     0x0002   120   120   000    Old_age   Always       -       50 (Min/Max 12/61)
196 Reallocated_Event_Count 0x0032   100   100   000    Old_age   Always       -       0
197 Current_Pending_Sector  0x0022   100   100   000    Old_age   Always       -       0
198 Offline_Uncorrectable   0x0008   100   100   000    Old_age   Offline      -       0
199 UDMA_CRC_Error_Count    0x000a   200   200   000    Old_age   Always       -       171
</pre>

<p>
其它硬碟都没有錯誤訊息，就是這顆 toshiba 2TB 的錯誤訊息如下：
</p>

<pre class="example">
Error 171 occurred at disk power-on lifetime: 12844 hours (535 days + 4 hours)
  When the command that caused the error occurred, the device was active or idle.

  After command completion occurred, registers were:
  ER ST SC SN CL CH DH
  -- -- -- -- -- -- --
  84 51 01 2f 36 5a 00  Error: ICRC, ABRT 1 sectors at LBA = 0x005a362f = 5912111

  Commands leading to the command that caused the error were:
  CR FR SC SN CL CH DH DC   Powered_Up_Time  Command/Feature_Name
  -- -- -- -- -- -- -- --  ----------------  --------------------
  35 00 00 2f 36 5a e0 ff      00:42:51.858  WRITE DMA EXT
  35 00 08 28 36 5a e0 00      00:42:51.857  WRITE DMA EXT
  ef 90 03 00 00 00 a0 00      00:42:50.877  SET FEATURES [Disable SATA feature]
  ef 02 00 00 00 00 a0 00      00:42:50.877  SET FEATURES [Enable write cache]
  35 00 00 2f 36 5a e0 ff      00:42:50.851  WRITE DMA EXT
</pre>

<p>
到 PCHOME 24hr，選了一顆 WD 紅標 3TB，接著就要等它來。當然不會再選
Toshiba 的，主要的原因是 Power_On_Hours 的時數不到其它 WD 的 1/3，卻先掛點，MTBF 差了點。
</p>

<p>
Google <code>Error: ICRC, ABRT</code> 的意義如下：
</p>
<pre class="example">
Interface CRC error during Ultra DMA transfer - often either a bad
cable or power problem, though possibly an incorrect Ultra DMA mode
setting by the driver. Command aborted - either command not supported,
unable to complete, or interface CRC (with ICRC).
</pre>

<p>
好像是要確認接線的狀況。
</p>

<p>
没關係，反正也想換硬碟，趁此機會，順便整理電腦。
</p>
</div>
</div>

<div id="outline-container-orgf652ba8" class="outline-2">
<h2 id="orgf652ba8">裝上新的硬碟</h2>
<div class="outline-text-2" id="text-orgf652ba8">
<p>
過程如下：
</p>

<ul class="org-ul">
<li class="on">
<code>[X]</code> setup HD: connect to computer</li>
<li class="on">
<code>[X]</code> gparted: create partition and format it in NTFS. <b>結果是在 windows 10 中做 partition 和 format.</b>
</li>
<li class="on">
<code>[X]</code> SMART check both old and new HD</li>
<li class="on">
<code>[X]</code> mount to linux</li>
<li class="on">
<code>[X]</code> sync from old to new HD: <code>rsync -av &lt;src&gt; &lt;desc&gt;</code>
</li>
<li class="on">
<code>[X]</code> if old HD is ok, then add it to lvm otherwise drop it</li>
<li class="on">
<code>[X]</code> disconnet old HD, reboot to windows 10</li>
<li class="on">
<code>[X]</code> set new HD to disk D:</li>
</ul>
<p>
要加到 lvm 就看 <a href="../replace-hd-on-lvm">replace hd on LVM</a> 這篇記錄，有經驗，不會太難。</p>
</div>
</div>
    </div>
    <aside class="postpromonav"><nav><ul itemprop="keywords" class="tags">
<li><a class="tag p-category" href="../../categories/smart/" rel="tag">smart</a></li>
            <li><a class="tag p-category" href="../../categories/wd/" rel="tag">WD</a></li>
            <li><a class="tag p-category" href="../../categories/windows/" rel="tag">windows</a></li>
        </ul>
<ul class="pager hidden-print">
<li class="previous">
                <a href="../happy-current/" rel="prev" title="快樂，當下">上一篇</a>
            </li>
            <li class="next">
                <a href="../hide-driver-on-windows/" rel="next" title="Windows 10 中，隱藏磁碟機">下一篇</a>
            </li>
        </ul></nav></aside><section class="comments hidden-print"><h2>迴響</h2>
        
        
        <div id="disqus_thread"></div>
        <script>
        var disqus_shortname ="simple-life",
            disqus_url="https://mariolong.github.io/posts/replace-new-hard-disk/",
        disqus_title="\u70ba windows 10\uff0c\u63db\u4e00\u9846\u786c\u789f",
        disqus_identifier="cache/posts/replace-new-hard-disk.html",
        disqus_config = function () {
            this.language = "zh_tw";
        };
        (function() {
            var dsq = document.createElement('script'); dsq.async = true;
            dsq.src = 'https://' + disqus_shortname + '.disqus.com/embed.js';
            (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
        })();
    </script><noscript>Please enable JavaScript to view the <a href="https://disqus.com/?ref_noscript" rel="nofollow">comments powered by Disqus.</a>
</noscript>
    <a href="https://disqus.com" class="dsq-brlink" rel="nofollow">Comments powered by <span class="logo-disqus">Disqus</span></a>


        </section></article><script>var disqus_shortname="simple-life";(function(){var a=document.createElement("script");a.async=true;a.src="https://"+disqus_shortname+".disqus.com/count.js";(document.getElementsByTagName("head")[0]||document.getElementsByTagName("body")[0]).appendChild(a)}());</script>
</div>
			</div>
			<!--End of body content-->
		</div>
		<div class="footerbox">
			Contents © 2018         <a href="mailto:mariolong5782@gmail.com">Mario Long</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         
			
		</div>
		
            <script src="../../assets/js/all-nocdn.js"></script><script>$('a.image-reference:not(.islink) img:not(.islink)').parent().colorbox({rel:"gal",maxWidth:"100%",maxHeight:"100%",scalePhotos:true});</script><!-- fancy dates --><script>
			moment.locale("zh-tw");
			fancydates(0, "YYYY-MM-DD HH:mm");
		</script><!-- end fancy dates -->
</div>
</body>
</html>
